# Center Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HomeCamera..::..Center Property
HomeCamera Class See Also
---
The zoom or orbit center.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ Center { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Center As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Center {
	XYZ^ get ();
}
```

# See Also
HomeCamera Class
Autodesk.Revit.DB Namespace